app/Models/EinheitModel.php

SELECT `einheiten`.*, `liegenschaften`.`name` as `liegenschaft_name`
FROM `einheiten`
JOIN `liegenschaften` ON `liegenschaften`.`id` = `einheiten`.`liegenschaft_id`
---
    public function getWithLiegenschaft($id = null)
    {
        $builder = $this->builder();
        $builder->select('einheiten.*, liegenschaften.name as liegenschaft_name');
        $builder->join('liegenschaften', 'liegenschaften.id = einheiten.liegenschaft_id');

        if ($id) {
            return $builder->where('einheiten.id', $id)->get()->getRowArray();
        }

        return $builder->get()->getResultArray();