app/Models/TransaktionModel.php

SELECT `transaktionen`.*, `kontakte`.`vorname`, `kontakte`.`nachname`, `einheiten`.`top_nummer`, `liegenschaften`.`name` as `haus_name`
FROM `transaktionen`
JOIN `mietvertraege` ON `mietvertraege`.`id` = `transaktionen`.`mietvertrag_id`
JOIN `kontakte` ON `kontakte`.`id` = `mietvertraege`.`mieter_id`
JOIN `einheiten` ON `einheiten`.`id` = `mietvertraege`.`einheit_id`
JOIN `liegenschaften` ON `liegenschaften`.`id` = `einheiten`.`liegenschaft_id`
WHERE `transaktionen`.`status` = 'offen'
ORDER BY `transaktionen`.`datum` DESC
---
    public function getDetailliert($status = null)
    {
        $builder = $this->select('transaktionen.*, kontakte.vorname, kontakte.nachname, einheiten.top_nummer, liegenschaften.name as haus_name')
            ->join('mietvertraege', 'mietvertraege.id = transaktionen.mietvertrag_id')
            ->join('kontakte', 'kontakte.id = mietvertraege.mieter_id')
            ->join('einheiten', 'einheiten.id = mietvertraege.einheit_id')
            ->join('liegenschaften', 'liegenschaften.id = einheiten.liegenschaft_id');

        if ($status) {
            $builder->where('transaktionen.status', $status);
        }

        return $builder->orderBy('transaktionen.datum', 'DESC')->findAll();